RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/src/hc32_ll_adc.c
/**
 *******************************************************************************
 * @file  hc32_ll_adc.c
 * @brief This file provides firmware functions to manage the Analog-to-Digital
 *        Converter(ADC).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2022-03-31       CDT             First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_adc.h"
#include "hc32_ll_utility.h"

/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @defgroup LL_ADC ADC
 * @brief Analog-to-Digital Converter Driver Library
 * @{
 */

#if (LL_ADC_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup ADC_Local_Macros ADC Local Macros
 * @{
 */
/**
 * @defgroup ADC_PGA_En ADC PGA Function Control
 * @{
 */
#define ADC_PGA_DISABLE                     (0x0U)
#define ADC_PGA_ENABLE                      (0xEU)
/**
 * @}
 */

/**
 * @defgroup ADC_Channel_Max ADC Channel Max
 * @{
 */
#define ADC1_CH_MAX                 (ADC_CH16)
#define ADC2_CH_MAX                 (ADC_CH8)
#define ADC1_REMAP_CH_MAX           (ADC_CH15)
#define ADC2_REMAP_CH_MAX           (ADC_CH7)
#define ADC1_REMAP_PIN_MAX          (ADC1_PIN_PC5)
#define ADC2_REMAP_PIN_MAX          (ADC2_PIN_PC1)
#define ADC_SSTR_NUM                (16U)
#define ADC1_SSTR_NUM               (ADC_SSTR_NUM)
#define ADC2_SSTR_NUM               (9U)

/**
 * @}
 */

/**
 * @defgroup ADC_Check_Parameters_Validity ADC check parameters validity
 * @{
 */
#define IS_ADC_1BIT_MASK(x)         (((x) != 0U) && (((x) & ((x) - 1U)) == 0U))

#define IS_ADC_BIT_MASK(x, mask)    (((x) != 0U) && (((x) | (mask)) == (mask)))

/* ADC unit check */
#define IS_ADC_UNIT(x)              (((x) == CM_ADC1) || ((x) == CM_ADC2))

#define IS_ADC_SEQ(x)               (((x) == ADC_SEQ_A) || ((x) == ADC_SEQ_B))

/* ADC channel check */
#define IS_ADC_CH(adc, ch)                                                     \
(   (((adc) == CM_ADC1) && ((ch) <= ADC1_CH_MAX))   ||                         \
    (((adc) == CM_ADC2) && ((ch) <= ADC2_CH_MAX)))

#define IS_ADC_SCAN_MD(x)                                                      \
(   ((x) == ADC_MD_SEQA_SINGLESHOT)         ||                                 \
    ((x) == ADC_MD_SEQA_CONT)               ||                                 \
    ((x) == ADC_MD_SEQA_SEQB_SINGLESHOT)    ||                                 \
    ((x) == ADC_MD_SEQA_CONT_SEQB_SINGLESHOT))

#define IS_ADC_RESOLUTION(x)                                                   \
(   ((x) == ADC_RESOLUTION_8BIT)            ||                                 \
    ((x) == ADC_RESOLUTION_10BIT)           ||                                 \
    ((x) == ADC_RESOLUTION_12BIT))

#define IS_ADC_HARDTRIG(x)                                                     \
(   ((x) == ADC_HARDTRIG_ADTRG_PIN)         ||                                 \
    ((x) == ADC_HARDTRIG_EVT0)              ||                                 \
    ((x) == ADC_HARDTRIG_EVT1)              ||                                 \
    ((x) == ADC_HARDTRIG_EVT0_EVT1))

#define IS_ADC_DATAALIGN(x)                                                    \
(   ((x) == ADC_DATAALIGN_RIGHT)            ||                                 \
    ((x) == ADC_DATAALIGN_LEFT))

#define IS_ADC_SEQA_RESUME_MD(x)                                               \
(   ((x) == ADC_SEQA_RESUME_SCAN_CONT)      ||                                 \
    ((x) == ADC_SEQA_RESUME_SCAN_RESTART))

#define IS_ADC_SAMPLE_TIME(x)       ((x) >= 5U)

#define IS_ADC_INT(x)               IS_ADC_BIT_MASK(x, ADC_INT_ALL)

#define IS_ADC_FLAG(x)              IS_ADC_BIT_MASK(x, ADC_FLAG_ALL)

/* Scan-average. */
#define IS_ADC_AVG_CNT(x)           (((x) | ADC_AVG_CNT256) == ADC_AVG_CNT256)

/* Channel remap. */
#define IS_ADC_REMAP_PIN(adc, pin)                                             \
(   (((adc) == CM_ADC1) && ((pin) <= ADC1_REMAP_PIN_MAX))   ||                 \
    (((adc) == CM_ADC2) && ((pin) <= ADC2_REMAP_PIN_MAX)))
#define IS_ADC_REMAP_CH(adc, ch)                                               \
(   (((adc) == CM_ADC1) && ((ch) <= ADC1_REMAP_CH_MAX))     ||                 \
    (((adc) == CM_ADC2) && ((ch) <= ADC2_REMAP_CH_MAX)))

/* Sync mode. */
#define IS_ADC_SYNC_MD(x)                                                      \
(   ((x) == ADC_SYNC_SINGLE_DELAY_TRIG)     ||                                 \
    ((x) == ADC_SYNC_SINGLE_PARALLEL_TRIG)  ||                                 \
    ((x) == ADC_SYNC_CYCLIC_DELAY_TRIG)     ||                                 \
    ((x) == ADC_SYNC_CYCLIC_PARALLEL_TRIG))

#define IS_ADC_SYNC(x)              ((x) == ADC_SYNC_ADC1_ADC2)

/* Analog watchdog. */
#define IS_ADC_AWD_MD(x)                                                       \
(   ((x) == ADC_AWD_MD_CMP_OUT)             ||                                 \
    ((x) == ADC_AWD_MD_CMP_IN))

#define IS_ADC_AWD(x)               ((x) == ADC_AWD0)

/* AWD flag check */
#define IS_ADC_AWD_FLAG(adc, flag)                                             \
(   (((adc) == CM_ADC1) && IS_ADC_BIT_MASK(flag, ADC1_AWD_FLAG_ALL))    ||     \
    (((adc) == CM_ADC2) && IS_ADC_BIT_MASK(flag, ADC2_AWD_FLAG_ALL)))

#define IS_ADC_AWD_INT(x)           IS_ADC_BIT_MASK(x, ADC_AWD_INT_ALL)

/* PGA */
#define IS_ADC_PGA_GAIN(x)          ((x) <= ADC_PGA_GAIN_32)

#define IS_ADC_PGA_VSS(x)           (((x) == ADC_PGA_VSS_PGAVSS) || ((x) == ADC_PGA_VSS_AVSS))

/* PGA unit */
#define IS_ADC_PGA(adc, pga)        (((adc) == CM_ADC1) && ((pga) == ADC_PGA1))
#define IS_PGA_ADC(x)               ((x) == CM_ADC1)
#define IS_ADC_PGA_INPUT_SRC(x)                                                \
(   IS_ADC_BIT_MASK(x, ADC_PGAINSR0_PGAINSEL) && IS_ADC_1BIT_MASK(x))

/**
 * @}
 */

/**
 * @}
 */

